import ReceiptCommentSection from "../coments";

function EachReceiptDescription() {
  return (
    <>
      <section className="each_receipt_description">
        <div className="description">
          {/* Short Description */}
          <div className="_short">
            <h5>მოკლე აღწერა:</h5>
            <hr />
            <p>
              ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი
              პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან
              მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი.
              ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი
              პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან
              მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი.
              ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი
              პროდუქტი. ძალიან მაგარი პროდუქტი. ძალიან მაგარი პროდუქტი.
            </p>
          </div>
          {/* Ingredients */}
          <div className="ingredients">
            <h5>ინგრედიენტები:</h5>
            <hr />
            <ul>
              <li>1 ჩ/კ შაქარი</li>
              <li>2 ს/კ ზეთი</li>
              <li>400გ კარაქი</li>
              <li>1კგ ფქვილი</li>
            </ul>
          </div>
          {/* Making Process */}
          <div className="making_process">
            <h5>მომზადების პროცედურა:</h5>
            <hr />
            {/* Steps */}
            <div className="step">
              <h4>ნაბიჯი 1</h4>
              <p>
                მოათავსეთ თარო ღუმელში და გააცხელეთ 375°F-მდე. წაუსვით კარაქი ან
                შეასხურეთ 12 ფორმა ჩვეულებრივი ზომის მაფინის ტაფაში ან მოათავსეთ
                ფორმებს სილიკონის ან ქაღალდის მაფინის საფენები. მაფინის ტაფა
                მოათავსეთ საცხობ ფირფიტაზე.
              </p>
            </div>
            <div className="step">
              <h4>ნაბიჯი 2</h4>
              <p>
                მოათავსეთ თარო ღუმელში და გააცხელეთ 375°F-მდე. წაუსვით კარაქი ან
                შეასხურეთ 12 ფორმა ჩვეულებრივი ზომის მაფინის ტაფაში ან მოათავსეთ
                ფორმებს სილიკონის ან ქაღალდის მაფინის საფენები. მაფინის ტაფა
                მოათავსეთ საცხობ ფირფიტაზე.
              </p>
            </div>
            <div className="step">
              <h4>ნაბიჯი 1</h4>
              <p>
                მოათავსეთ თარო ღუმელში და გააცხელეთ 375°F-მდე. წაუსვით კარაქი ან
                შეასხურეთ 12 ფორმა ჩვეულებრივი ზომის მაფინის ტაფაში ან მოათავსეთ
                ფორმებს სილიკონის ან ქაღალდის მაფინის საფენები. მაფინის ტაფა
                მოათავსეთ საცხობ ფირფიტაზე.
              </p>
            </div>
          </div>

          {/* Section */}
          <div className="comment">
            <ReceiptCommentSection />
          </div>
        </div>

        <aside className="right_side">
          {/* Table */}
          <div className="for_sticky">
            <table>
              <thead>
                <tr>
                  <th>დონე</th>
                  <th>მომზადების დრო</th>
                  <th>პორცია</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>მარტივი</td>
                  <td>45 წუთი</td>
                  <td>10</td>
                </tr>
              </tbody>
            </table>

            {/* Nutrition */}
            <div className="nutrition">
              <h3>საკვები შემადგენლობა:</h3>
              <ul>
                <li>
                  <p>კალორია</p>
                  <span>235</span>
                </li>
                <li>
                  <p>ცხიმი</p>
                  <span>12 გ</span>
                </li>
                <li>
                  <p>ნახშირწყლები</p>
                  <span>23 გ</span>
                </li>
                <li>
                  <p>პროტეინი</p>
                  <span>11 გ</span>
                </li>
              </ul>
            </div>
          </div>
        </aside>
      </section>
    </>
  );
}

export default EachReceiptDescription;
